In [2]:
#even odd

In [8]:
def even_odd():
    num = int(input('enter your number'))
    if num%2 == 0:
        print('The number is even !!')
    else:
        print('the number is prime !!!')

In [10]:
even_odd()

enter your number 55

the number is prime !!!

In [20]:
def pyramid(n,typ = 'centre' , shape = '*'):
    if typ == 'right':
        space = ''
    elif typ == 'left':
        space = '  '
    elif typ == 'centre':
        space = ' '
    for i in range(1,n+1):
        print(space*(n-i) + i*f' {shape} ')

In [24]:
pyramid(5,'centre','*')

     *
    *  *
   *  *  *
  *  *  *  *
 *  *  *  *  *

In [26]:
#hashtag generator

In [28]:
def hashtag_generator(*args):
    result = []
    for i in args:
        result.append('#' + i.upper())
    return result

In [30]:
hashtag_generator('a','b','d','f','g')

['#A', '#B', '#D', '#F', '#G']

In [42]:
#keyword_arguments kwargs
def student_records(**kwargs):
    import pandas as pd
    try:
        result = pd.DataFrame(kwargs)
        return result
    except:
        result = pd.DataFrame(kwargs,index=[1])
        return result


student_records(
    Name = ['ashmeet' , 'ashh' , 'aman'],
    Age  = [15,55,66],
    Salary = [2000,200,622],
    City = ['Delhi', 'Goa', 'Maharashtra']
)

      Name  Age  Salary         City
0  ashmeet   15    2000        Delhi
1     ashh   55     200          Goa
2     aman   66     622  Maharashtra

In [44]:
student_records(
    Name = ['ashmeet' , 'ashh' , 'aman'],
    Age  = [15,55,66],
    Salary = [2000,200,622],
    City = ['Delhi', 'Goa', 'Maharashtra']
)

      Name  Age  Salary         City
0  ashmeet   15    2000        Delhi
1     ashh   55     200          Goa
2     aman   66     622  Maharashtra